{
  "Login & Access Issues": {
    "What does “Beneficiary User ID invalid” mean or why is my account not letting me log in?": "If you're seeing the message “Beneficiary User ID invalid” or are unable to log in, here are some possible reasons:\n\n✅ You may have entered your Username or Password incorrectly\n- Usernames and Passwords are case-sensitive. Double-check spelling and spaces.\n\n✅ Your User ID was provided by KEF\n- Contact your KEF facilitator if you’re unsure.\n\n✅ Too many wrong attempts? Your account might be locked\n- A reset link may be sent to your email. If not received, inform your facilitator.\n\n💡 Tip: Always keep your login details safe and private.",
    "What should I do if I need to update my contact number for login ID creation?": "If your contact number has changed or needs to be corrected:\n\n1️⃣ Inform your KEF facilitator and share:\n- Updated phone number\n- Your name, school, and geography\n\n2️⃣ Or raise a request using 'Site Support' with:\n- Full name\n- Old and new phone numbers\n- Login ID, school, geography\n\n📌 Your contact number is important for verification and support communication.",
    "What can I do if I can’t see the course on my dashboard?": "If your course is not visible:\n\n✅ You might not be enrolled yet. KEF maps your ID to your school/project manually.\n\n📌 What to do:\n- Inform your KEF facilitator\n- Raise a support ticket with your:\n  - Name, login ID, school, geography\n  - Course name (if known)\n\n🔔 Once enrollment is done, the course will appear in your dashboard."
  },
  "Course Progress & Activity Issues": {
    "What should I do if I can't understand how to go to the next step in the course?": "If you're stuck:\n\n✅ Complete the Previous Activity Fully:\n- Finish H5P activities completely\n- Click the ⭐ icon or 'Submit Answers'\n\n✅ On Mobile?\n- Use the Moodle app\n- Or turn on Desktop Mode in browser\n\n✅ Refresh or Reopen the Activity\n\nStill stuck? Contact your KEF facilitator or use the Help section.",
    "What should I do if I’m facing technical problems like “File not found”?": "If you see a 'File not found' error:\n\n1️⃣ Note the course and specific video/resource\n\n2️⃣ Inform your KEF facilitator or raise a Site Support ticket\n- Include exact file name and course details\n\n📌 Why it matters:\n- You need to complete all content for course completion and certificates\n\nIf possible, continue with other course parts and return to the issue later.",
    "I have completed the course, but why can't I download my certificate?": "Check the following:\n\n✅ Course Completion\n- Progress bar should show 100%\n- Common misses:\n  - Not clicking 'Submit' on quizzes\n  - Not finishing videos completely\n\n✅ Where to find your certificate:\n- Go to 'Certificates' in your dashboard (OneKEF website/app)\n\nStill not visible?\n- Inform your facilitator — support team will manually issue it.",
    "I can’t move to the next step in the course even after completing the current activity": "Possible reasons:\n\n- H5P activities not properly submitted (didn’t click ⭐ or 'Submit')\n- Activity not fully completed\n- Mobile view may hide some buttons ➝ Try Moodle app or Desktop Mode\n\n✅ Refresh the page or re-open activity.\nStill facing issues? Contact KEF support.",
    "My course completion bar is not showing 100%, even though I finished all activities": "Check that you've:\n- Submitted all quizzes/H5P activities\n- Watched videos completely\n- Clicked all required buttons ('Submit', 'Finish attempt', etc.)\n\nStill not working? Inform KEF support for manual review.",
    "I’m not able to submit or complete a quiz / H5P / assignment": "Make sure you:\n- Finish the activity\n- Click 'Submit Answers' or ⭐ icon\n- Use Desktop Mode or Moodle app if on mobile\n\nStill facing problems? Take a screenshot and raise a support request."
  },
  "Certificate Issues": {
    "How can I request a name correction on my certificate?": "Steps:\n\n✅ Inform your KEF facilitator\n- Provide your correct name (first and last)\n- Include login ID, course name, school/geography\n\n✅ Or raise a Site Support ticket with:\n- Current and correct names\n- Login ID\n- Course/geography\n\n📌 Tip: Raise correction within 30 days of course completion.",
    "I have completed the course, but can’t download the certificate": "Ensure 100% course completion. Check:\n\n- All quizzes submitted\n- All videos watched\n- Interactive activities completed\n\nCertificate will appear in 'Certificates' section on dashboard.\n\nIf not, contact KEF facilitator for support team to issue manually."
  },
  "Other Technical or Content Issues": {
    "A course resource (video, PDF, etc.) is not opening properly": "Try the following:\n\n1️⃣ Refresh the page\n2️⃣ Use a different browser or switch to Desktop Mode\n3️⃣ Use the Moodle app\n\nStill not opening? Raise a support request with course details and screenshots.",
    "I am facing some other issue (Please describe in detail below)": "Please share:\n- Your name, login ID\n- Course name and geography\n- Description of the issue\n- Screenshot (if possible)\n\nUse the “Site Support” section or inform your KEF facilitator."
  }
}
